In [1]:
import pandas as pd
import numpy as np
from datetime import datetime
# Configuración
# -----------------------------------------------------------------------
pd.set_option('display.max_columns', None) # para poder visualizar todas las columnas de los DataFrames

In [2]:
df_clean = pd.read_csv('hr_raw_data_clean.csv', index_col=0)

### FUNCIÓN PARA HOMOGENEIZAR DATOS DE "AGE"

In [3]:
def age(year):
    '''Mantenemos la columna edad actualizada restando el año actual 
    con el año de nacimiento registrado en la columna "datebrith".
    usamos la libreria datetime
    '''
    age_def = (datetime.now().year) - year
    return age_def

df_clean["age"] = df_clean["datebirth"].apply(age)

df_clean.sample(5)

,age,attrition,businesstravel,dailyrate,department,distancefromhome,education,educationfield,employeecount,employeenumber,environmentsatisfaction,gender,hourlyrate,jobinvolvement,joblevel,jobrole,jobsatisfaction,maritalstatus,monthlyincome,monthlyrate,numcompaniesworked,over18,overtime,percentsalaryhike,performancerating,relationshipsatisfaction,standardhours,stockoptionlevel,totalworkingyears,trainingtimeslastyear,worklifebalance,yearsatcompany,yearsincurrentrole,yearssincelastpromotion,yearswithcurrmanager,sameasmonthlyincome,datebirth,salary,roledepartament,numberchildren,remotework
1216,47,No,travel_rarely,1973.984127,NaN,2,4,NaN,1,1217,3,0,246.748016,3,5,REseARcH DiRectOr,4,NaN,"15943,72$","41453,67$",7,Y,NaN,17,"3,0",3,Full Time,1,"24,0",3,"3,0",2,NaN,2,2,"15943,72$",1977,"191324,62$",NaN,NaN,1
1487,22,No,NaN,213.571429,NaN,-25,1,NaN,1,1488,4,1,26.696429,2,1,REsEaRch scIenTIsT,2,Single,NaN,"4485,00$",1,Y,Yes,11,"3,0",3,Part Time,0,"2,0",6,"4,0",2,NaN,2,2,NaN,2002,"20700,00$",NaN,NaN,1
1060,45,No,NaN,352.857143,NaN,20,3,Life Sciences,1,1061,4,0,44.107143,3,1,rEsEarCH SCIeNtist,2,NaN,"2850,00$","7410,00$",1,Y,NaN,13,"3,0",3,Full Time,0,"6,0",3,"2,0",5,NaN,1,3,"2850,00$",1979,"34200,00$",NaN,NaN,0
1389,46,No,travel_frequently,1863.436508,NaN,25,3,Medical,1,1390,2,1,NaN,3,5,manAGEr,2,NaN,"15050,83$","39132,17$",3,NaN,NaN,22,"4,0",3,Full Time,0,"22,0",4,"3,0",0,NaN,0,0,"15050,83$",1978,"180610,00$",NaN,NaN,0
1499,32,No,travel_rarely,564.158730,NaN,29,4,Marketing,1,1500,1,1,NaN,2,2,saLeS eXEcUTivE,4,NaN,NaN,"11847,33$",1,NaN,NaN,14,"3,0",1,Full Time,2,NaN,3,"3,0",12,NaN,5,7,NaN,1992,"54680,00$",NaN,NaN,1

In [5]:
df_clean["age"].isnull().sum()

np.int64(0)

### FUNCIÓN PARA REEMPLAZAR , por . Y ELIMINAR $

In [6]:
def replace_dot(cadena):
    ''' Para las columnas cuyos valores son object con separación con comas y símbolo 
    de $ al final. 
    Sustituir , por . y eliminar &
    Pasar el valor a float'''
    try:
        # Reemplazar las comas por puntos en la cadena
        return float(cadena.replace(",", ".").replace("$",""))
    
    except:
        # Si ocurre algún error (por ejemplo, si el argumento no es una cadena),
        # devolver np.nan (valor Not a Number) para indicar un valor inválido o no disponible.
        return np.nan

lista_columnas=["monthlyincome", "monthlyrate", "performancerating", "totalworkingyears", "worklifebalance", "sameasmonthlyincome", "salary"]

for columna in lista_columnas:
     df_clean[columna] = df_clean[columna].apply(replace_dot)

df_clean.head(5)

,age,attrition,businesstravel,dailyrate,department,distancefromhome,education,educationfield,employeecount,employeenumber,environmentsatisfaction,gender,hourlyrate,jobinvolvement,joblevel,jobrole,jobsatisfaction,maritalstatus,monthlyincome,monthlyrate,numcompaniesworked,over18,overtime,percentsalaryhike,performancerating,relationshipsatisfaction,standardhours,stockoptionlevel,totalworkingyears,trainingtimeslastyear,worklifebalance,yearsatcompany,yearsincurrentrole,yearssincelastpromotion,yearswithcurrmanager,sameasmonthlyincome,datebirth,salary,roledepartament,numberchildren,remotework
0,52,No,NaN,2015.722222,NaN,6,3,NaN,1,1,1,0,NaN,3,5,resEArch DIREcToR,3,NaN,16280.83,42330.17,7,Y,No,13,3.0,3,Full Time,0,NaN,5,3.0,20,NaN,15,15,16280.83,1972,195370.0,NaN,NaN,Yes
1,53,No,NaN,2063.388889,NaN,1,4,Life Sciences,1,2,3,0,NaN,2,5,ManAGeR,3,NaN,NaN,43331.17,0,NaN,NaN,14,3.0,1,NaN,1,34.0,5,3.0,33,NaN,11,9,NaN,1971,199990.0,NaN,NaN,1
2,43,No,travel_rarely,1984.253968,Research & Development,4,2,Technical Degree,1,3,3,0,NaN,3,5,ManaGER,4,Married,NaN,41669.33,1,NaN,No,11,3.0,4,NaN,0,22.0,3,NaN,22,NaN,11,15,NaN,1981,192320.0,ManaGER - Research & Development,NaN,1
3,48,No,travel_rarely,1771.404762,NaN,2,4,Medical,1,4,1,1,NaN,3,4,ReseArCH DIrECtOr,3,Married,14307.50,37199.50,3,Y,NaN,19,3.0,2,Full Time,2,NaN,2,NaN,20,NaN,5,6,14307.50,1976,171690.0,NaN,NaN,False
4,47,No,NaN,1582.771346,NaN,3,3,Technical Degree,1,5,1,1,NaN,4,4,sAleS EXECUtIve,1,Divorced,12783.92,33238.20,2,Y,No,12,3.0,4,NaN,1,NaN,5,3.0,19,NaN,2,8,12783.92,1977,NaN,NaN,NaN,0

### redondear valores de tipo float con muchos decimales, a 2 decimales

In [7]:
df_clean["dailyrate"] = round(df_clean["dailyrate"], 2)
df_clean["hourlyrate"] = round(df_clean["hourlyrate"], 2)
df_clean.head(2)

,age,attrition,businesstravel,dailyrate,department,distancefromhome,education,educationfield,employeecount,employeenumber,environmentsatisfaction,gender,hourlyrate,jobinvolvement,joblevel,jobrole,jobsatisfaction,maritalstatus,monthlyincome,monthlyrate,numcompaniesworked,over18,overtime,percentsalaryhike,performancerating,relationshipsatisfaction,standardhours,stockoptionlevel,totalworkingyears,trainingtimeslastyear,worklifebalance,yearsatcompany,yearsincurrentrole,yearssincelastpromotion,yearswithcurrmanager,sameasmonthlyincome,datebirth,salary,roledepartament,numberchildren,remotework
0,52,No,NaN,2015.72,NaN,6,3,NaN,1,1,1,0,NaN,3,5,resEArch DIREcToR,3,NaN,16280.83,42330.17,7,Y,No,13,3.0,3,Full Time,0,NaN,5,3.0,20,NaN,15,15,16280.83,1972,195370.0,NaN,NaN,Yes
1,53,No,NaN,2063.39,NaN,1,4,Life Sciences,1,2,3,0,NaN,2,5,ManAGeR,3,NaN,NaN,43331.17,0,NaN,NaN,14,3.0,1,NaN,1,34.0,5,3.0,33,NaN,11,9,NaN,1971,199990.0,NaN,NaN,1

In [17]:
def eliminar_columnas(df, nombre_columna):
    df_drop = df.drop(nombre_columna, axis=1, inplace=True) # hay que asignarle una variable para que lo guarde. Comprobado que funciona, cambiamos el inplace por True.
    print(f'La columna {nombre_columna} se ha eliminado correctamente.')
    return df_drop.head(1)

### FUNCIÓN MAP PARA HOMOGENEIZAR REMOTEWORK

In [8]:
diccionario_remote = {"1": "Yes", "0": "No", "Yes": "Yes", "True": "Yes", "False": "No"}
df_clean["remotework"] = df_clean["remotework"].map(diccionario_remote)

df_clean.head(2)

,age,attrition,businesstravel,dailyrate,department,distancefromhome,education,educationfield,employeecount,employeenumber,environmentsatisfaction,gender,hourlyrate,jobinvolvement,joblevel,jobrole,jobsatisfaction,maritalstatus,monthlyincome,monthlyrate,numcompaniesworked,over18,overtime,percentsalaryhike,performancerating,relationshipsatisfaction,standardhours,stockoptionlevel,totalworkingyears,trainingtimeslastyear,worklifebalance,yearsatcompany,yearsincurrentrole,yearssincelastpromotion,yearswithcurrmanager,sameasmonthlyincome,datebirth,salary,roledepartament,numberchildren,remotework
0,52,No,NaN,2015.72,NaN,6,3,NaN,1,1,1,0,NaN,3,5,resEArch DIREcToR,3,NaN,16280.83,42330.17,7,Y,No,13,3.0,3,Full Time,0,NaN,5,3.0,20,NaN,15,15,16280.83,1972,195370.0,NaN,NaN,Yes
1,53,No,NaN,2063.39,NaN,1,4,Life Sciences,1,2,3,0,NaN,2,5,ManAGeR,3,NaN,NaN,43331.17,0,NaN,NaN,14,3.0,1,NaN,1,34.0,5,3.0,33,NaN,11,9,NaN,1971,199990.0,NaN,NaN,Yes

### FUNCIÓN PARA PONER EN MINÚSCULAS

In [9]:
def minusculas(cadena): 
    try:
        return cadena.lower()
    except:
        return "no data"

lista_columnas=["department", "educationfield", "jobrole", "roledepartament"]
for col in lista_columnas:
    df_clean[col] = df_clean[col].apply(minusculas)

## FUNCION PARA RATIOS DE "ENVIRONMENTSATISFACTION"

In [10]:
def clean_satisfaction(valoracion):
    try: 
        if valoracion >= 10:
            return int(str(valoracion/10).split('.')[0])
        else: 
            return valoracion
    except:
            return np.nan


df_clean["environmentsatisfaction"] = df_clean["environmentsatisfaction"].apply(clean_satisfaction)

### GENDER

In [11]:
dict_gender = {0: "M", 1: "F"}

df_clean["gender"] = df_clean["gender"].map(dict_gender)

# 14 de noviembre de 2024

### FUNCIÓN PARA BORRAR COLUMNAS

In [25]:
def clean (dataframe,col_data):
    
    return dataframe.drop([col_data],axis=1, inplace= True)

In [29]:
lista_drop= ["sameasmonthlyincome", "over18", "numberchildren", "employeecount"]

for col in lista_drop:
    clean(df_clean, col)

In [68]:
df_clean[["yearsincurrentrole", "yearssincelastpromotion", "yearsatcompany"]].sample(10)

     yearsincurrentrole  yearssincelastpromotion  yearsatcompany
517                 6,0                        8              21
1332                NaN                        0               3
273                 NaN                        2               9
7                   NaN                       11              20
874                 NaN                        7               8
352                 NaN                        4              15
884                 2,0                        2               3
670                 NaN                        0               4
1046                NaN                        2               2
1603                NaN                        7               8

In [41]:
df_clean[["joblevel","jobrole", "roledepartament","department"]].sample(10)

,joblevel,jobrole,roledepartament,department
1104,1,human resources,human resources - human resources,human resources
507,3,healthcare representative,no data,no data
651,1,laboratory technician,laboratory technician - research & developm...,research & development
290,2,sales executive,no data,no data
1658,1,laboratory technician,laboratory technician - research & developm...,research & development
836,1,laboratory technician,no data,no data
359,1,research scientist,no data,no data
1399,1,sales representative,no data,no data
138,4,manager,manager - sales,sales
440,2,manufacturing director,manufacturing director - research & develop...,research & development

### GUARDAR CSV

In [70]:
df_clean.to_csv("hr_raw_data_clean.csv")